{
    "id": "TU0-000",
    "title": "These 3 Alien Planets Around a Tiny, Cold Star Just Might Support Life",
    "description": "Three potentially habitable Earth-size planets have been discovered orbiting a dim, cold nearby star that is barely larger than Jupiter, researchers say.",
    "authors": [
        "Charles Q. Choi"
    ],
    "date": "2016-05-02T12:30:00.000Z",
    "content": "<p>\"These kinds of tiny, cold stars may be the places we should first look for life elsewhere in the universe, because they may be the only places where we can detect life on distant Earth-sized planets with our current technology,\" study lead author Michaël Gillon, an astronomer at the University of Liège in Belgium, told Space.com.</p><p>Astronomers focused on a star originally named 2MASS J23062928-0502285 that was discovered using TRAPPIST (TRAnsiting Planets and PlanetesImals Small Telescope), a telescope in Chile. This dim cold red star, now known as TRAPPIST-1, is located in the constellation of Aquarius about 39 light-years from Earth. In comparison, Alpha Centauri, the nearest star system, is about 4.3 light-years from Earth.</p><p>TRAPPIST-1 is 2,000 times less bright than the sun, a bit less than half as warm as the sun, about one-twelfth the sun's mass, and less than one-eighth the sun's width, making it only slightly larger in diameter than Jupiter. TRAPPIST-1 is a type of star known as an ultracool dwarf that is very common in the Milky Way, making up about 15 percent of the stars near the sun.</p><p>Scientists spotted the three planets by observing TRAPPIST-1 dimming at regular intervals as the worlds crossed in front of it. This is the first time that distant planets, called exoplanets, have been found around an ultracool dwarf, the researchers said.</p><p>\"So far, the existence of such 'red worlds' orbiting ultracool dwarf stars was purely theoretical, but now we have not just one lonely planet around such a faint red star, but a complete system of three planets,\" study co-author Emmanuël Jehin, an astronomer at the University of Liège, said in a statement.</p><p>These three planets are each only about 10 percent larger in diameter than Earth. \"The kind of planets we've found are very exciting from the perspective of searching for life in the universe beyond Earth,\" study co-author Adam Burgasser at the University of California, San Diego, said in a statement.</p><p>The two innermost planets are about 60 to 90 times closer to their star than the Earth to the sun, with orbits only 1.5 and 2.4 days long, respectively. The orbit of the third planet is currently less certain, ranging between 4.5 and 73 days long. The small size of the star and its planets' orbits means \"the structure of this planetary system is much more similar in scale to the system of Jupiter's moons than to that of the solar system,\" Gillon said in the statement.</p>",
    "images": [
        {
            "url": "http://www.space.com/images/i/000/055/177/original/three-alien-planets-trappist-2.jpg",
            "description": "On May 2, 2016, scientists announced the discovery of TRAPPIST-1, an alien solar system 40 light-years from Earth with a tiny, ultracool dwarf star and three small exoplanets that just might be habitable. See imaginary views of the TRAPPIST-1 system in this slideshow. HERE: An artist's view of the TRAPPIST-1 star system as seen from near one of the three alien planets circling their dim parent star.",
            "authors": ["ESO/M. Kornmesser"]
        }
    ],
    "video": {
        "url": "http://localhost/app_data/videos/vid00.mp4", 
        "id": "z1Pqqf_6J9w",
        "description": "Planet search: Three new planets discovered orbiting around an ultracool dwarf star",
        "authors": ["TomoNews"]
    }
}