{
    "id": "TU1-000",
    "title": "DIZAJN KOZMO EKOSISTEMA 2016",
    "description": "Projekt pri predmetu Interaktivnost in oblikovanje informacij",
    "authors": [
        "Tjaša Čeh",
        "Andrej Pavel Kozak",
        "Miha Pleško",
    ],
    "date": "2016-06-07T23:59:59.000Z",
    "content": "<h2>Povzetek</h2><p>Če želimo ljudje ustvariti življenje na praznem planetu, moramo začeti na začetku. Najprej moramo omogočiti preživetje majhnim bakterijam, ki bodo nekoč omogočile življenje nam. S tem namenom smo oblikovali kolonijo, tj. nabor šestih vrst bakterij, ki živijo v sožitju ena z drugo. Računalniška simulacija nam omogoča, da pošljemo to kolonijo na enega od šestih izmišljenih planetov in opazujemo, kako težko je preživeti v ostrih razmerah, kjer si moraš vso hrano šele pridelati. Doprinos naloge je uporabniku pokazati, da je preživetje na pustem planetu že za majhne bakterije velik problem.</p><h2>Uvod</h2><p>Želeli smo ustvariti čim bolj realen ekosistem, ki bi omogočal čim daljše preživetje na tujem planetu. Ker je ta naloga očitno zelo zahtevna, smo se osredotočili na dva glavna elementa, ki tvorita žive organizme, to sta ogljik in dušik. Naredili smo nekakšen krog snovi, ki so na planetih prisotne. Uporabili smo snovi iz ogljika (ogljikov dioksid – CO2 in metan – CH4), dušika (dušik – N2, amonijak – N H3 in nitrit – N O2), poleg tega pa še nekaj snovi drugih elementov (vodik – H2, kisik – O2) ter organske spojine, ki so sestavljene tako iz ogljika kot dušika. Naši organizmi pretvarjajo te snovi med sabo, pri tem rastejo in se množijo, snovi pa krožijo (da jih lahko uporabijo tudi drugi).</p><h2>Cilji projekta</h2><p>Postavili smo osnovne cilje projekta:</p><ol><li>Izbor članov bakterijske kolonije</li><li>Definicija modelov in pravil za računalniško simulacijo kolonije</li><li>Privlačen uporabniški vmesnik simulacije z možnostjo spreminjanja začetnih parametrov</li><li>Empirična določitev primernega ravnotežja začetnega števila članov na podlagi simulacije</li></ol><h2>Člani bakterijske kolonije</h2><p>Poiskali smo osnovni sklenjeni tok kemijskih reakcij ter bakterije, ki ga podpirajo (glej Sliko ??). Tekom projekta bomo morda odkrili, da potrebujemo še kakšne dodatne bakterije za okrepitev določenih delov kroga kemijskih reakcij, ali pa se bo morda izkazalo, da je nekatere bakterije smiselno zamenjati z drugimi.</p><h2>Zaključek</h2><p>Pri projektu nam je uspelo nastaviti ekosistem, ki je neodvisen od zunanjih snovi. Bakterije nam je uspelo obdržati pri življenju več kot 30 dni, kar pa se lahko po naših predvidevanjih še zelo izboljša. Če želimo življenje na drugem planetu obdržati neskončno dolgo, pa bo treba vložiti še veliko dela. Naš projekt je lahko temelj za naslednje, obsežnejše projekte, ki bodo morali upoštevati še veliko drugih parametrov (druga hranila, sončno sevanje, mobilnost elementov, aerobnost, ...), kot smo jih mi (reakcija, razmnoževanje, afiniteta).</p>",
    "images": [
        {
            "id": "1",
            "url": "http://www.space.com/images/i/000/054/459/original/VLT-Laser-Guide-Star.jpg?interpolation=lanczos-none&downsize=*:1400",
            "description": "Slika 1: Sklenjen tok elementov, ki ga podpirajo člani kolonije (bakterije). Proizvod ene bakterije je hrana drugi bakteriji, zato je pravilna izbira bakterij življenjskega pomena za celotno kolonijo. Vozlišča na sliki prikazujejo elemente, povezave pa bakterije, ki pretvarjajo elemente v smeri puščice. Vsaka izmed šestih vrst bakterij je obarvana s svojo barvo.",
            "authors": []
        },
        {
            "id": "2",
            "url": "http://www.space.com/images/i/000/054/335/original/stromatolite-lake-joyce.jpg?interpolation=lanczos-none&downsize=*:1400",
            "description": "Slika 2: Grafični vmesnik simulacije. 1 - posamezna vrsta bakterij. En krogec predstavlja eno bakterijo. Radij ustreza količini energije, ko jo bakterija še ima. (glej legendo spodaj), 2 - stanje elementov na planetu. En kvadratek predstavlja eno molekulo elementa, 3 - upravljanje s simulacijo, 4 - interaktivna shema reakcij (debelina puščic ustreza številu reakcij, ki so se izvedle ta dan).",
            "authors": []
        }
    ],
    "video": {
        "id": null,
        "url": null,
        "description": null,
        "authors": []
    },
    "other": ""
}