{
    "id": "TU1-001",
    "title": "Ekstrateristična biotehnologija",
    "description": "Projekt Bactopod",
    "authors": [
        "Aljoša Šinkovič",
        "Svetlana Utrosa",
        "Rok Rupnik"
    ],
    "date": "2016-06-07T23:59:59.000Z",
    "content": "<h2>Povzetek</h2><p>V našem projektu želimo prikazati uporabo biotehnoloških rešitev v vesolju na vizualen način. Pri tem bomo družili naša znanja iz biotehnološkega in računalniškega področja. Ukvarjali se bomo z reševanjem problema generacije kisika in goriva, ki jih potrebuje poljubno vesoljsko plovilo. Ta problem bomo reševali s t.i. motorjev iz bioreaktorjev, ki ob prisotnosti sončne svetlobe generira kisik in gorivo za pogonski del plovila. Želimo prikazati predvsem odvisnost generacije željenih snovi v odvisnosti od prisotnosti sončne svetlobe, tako na nivoju ene celice, kot tudi na nivoju plovila.</p><h2>Uvod</h2><p>Potovanje po vesolju z upravljenjem vesoljskih plovil zajema razvoj znanja iz različnih področij in zahteva natančno upravljanje z razpoložljivimi viri. Ti viri zagotavljajo vrsto različnih pogojev, ki so potrebni in nujni za potovanje v vesolju. Govorimo predvsem o sistemih za podporo življenja in pogonskih sistemih, potrebnih za premikanje. V sistemih za podporo življenja je potrebno najprej poskrbeti za zrak, ki ga astronavti dihajo, ker bi odsotnost ustrezne mešanice plinov najhitreje povzročila uničujoče učinke. Obstajata dve osnovni rešitvi za vzdrževanje umetne atmosfere. Prva je mešanica kisika in dušika, ki posnema Zemljino atmosfero, druga pa je uporaba čistega kisika, ki se lahko uporablja pri manj kot običajnemu zračnem tlaku. Mešanico kisika in dušika uporabljajo na mednarodni vesoljski postaji in v vesoljskih plovilih Soyuz, medtem ko je kisik pri nižjem zračnem tlaku ponavadi uporabljan v vesoljskih opravah za aktivnosti izven plovila[1] Močno pogonsko gorivo za naše plovilo bi bil lahko vodik, ki ga bodo izločale bakterije, ki bi jih uporabili v naših 'gorivnih celicah'.</p><h2>Glavni cilji projekta</h2><ol><li>Izris enega modela naših gorivnih celic.</li><li>Izris primera uporabe naših gorivnih celic na vesoljskem plovilu.</li><li>Izdelava znanstvene podlage za simulacijo gorivnih celic.</li><li>Simulacija generacije kisika in goriva v odvisnosti od sonca.</li><li>Animacija simulacije za posamično gorivno celico.</li><li>Animacije simulacije za celotno plovilo.</li></ol><h2>Gradivo in metode</h2><p>V tem poglavju bomo predstavili znanstvene temelje našega projekta in kasnejše implementacijske detajle.</p><h2>Znanstvena podlaga</h2><p>Naš projekt se bo imenoval Bactopod, in sicer zato, ker gre za bakteriji-podobno strukturo, v našem primeru plovilo za potovanje po vesolju. Glavna razlika, ki loči naše plovilo od ostalih veosljskih plovil je zmožnost samooskrbe, saj je njen glavni motor bioreaktorsko jadro, ki se razpre po potrebi. V bioreaktorju imamo zelo učinkovito, gensko modificirano enocelično algo, ki s pretvarjanjem ogljikovega dioksida in vode, ob pomoči sončne svetlobe, proizvaja kisik in gorivo za plovilo. Namen tega jadra je, da se, ko je padec svetlobnih žarkov optimalen, razpre in funkcionira samo v tem svetlobnem optimumu. Med delovanjem in aktivnostjo alg se polni rezervoar za gorivo ter rezervoar za kisik, ki je namenjen posadki (in tudi algam). Ko se vsi rezervoarji napolnijo, se jadro pospravi nazaj v svojo komoro na sprednjem delu plovila, plovilo pa lahko potuje naprej, do naslednje porabe zalog. Izmenjava snovi med bioreaktorji in trupom plovila bo potekalo preko opornih cevi oziroma stebrov, ki bodo jadro držali in razpenjali na svojem mestu. Preko kontrolnega panela bo posadka lahko nadzirala stanje v posameznih bioreaktorjih in tudi zamenjala celično kulturo, če bi bilo to potrebno.</p><h2>Animacija</h2><p>Naše gradivo bodo predvsem objekti in slike, ki jih bomo bodisi našli na internetu ali še bolj verjetno zmodelirali sami v programih kot je na primer SketchUp. Te objekte bomo kasneje animirali v okolju WebGL [2], kar nam bo omogočilo enostaven prikaz naše animacije v novejših brskalnikih. WebGL je razširitev programskega jezika Javascript, ki v novejših brskalnikih omogoča prikaz 3D grafičnih elementov v realnem času. Glavni vir interakcije z uporabnikom bo uporabniku ponujena možnost, da bo lahko obračal svoj pogled oz. zorni kot na samo animacijo.</p><h2>Zaključek</h2><p>Na sliki 2 je prikazan miselni vzorec z zasnovo projekta, kot smo ga opisali v prejšnjih delih. Opisana tudi osnovna razdelitev dela in osnoven problem ter rešitve zanj. Končni izdelek bo torej računalniška animacija izbranih objektov v vesolju. Prikazovali bomo odvisnost našega pogona od prisotnosti sonca. Naštel bom nekaj ključnih lastnosti naše animacije.</p><ul><li>Prikazali bomo delovanje ene gorivne celice in delovanje več celic priklopljenih na pogon vesoljskega plovila.</li><li>Prikazali bomo potovanje po vesolju na zelo velikih razdaljah.</li><li>Prikazali bomo dva načina delovanja vesoljskega plovila - polnjenje rezervoarjev ob prisotnosti svetlobe in potovanje z zbranim gorivom.</li><li>Vir goriva in kisika bodo ustrezne bakterije.</li><li>Način interakcije z uporabnikom bo obračanje kamere oz. pogleda na animacijo.</li><li>Animacija bo izdelana za brskalnike, da jo bomo z lahkoto prikazovali v različnih okoljih.</li><li>3D model bomo izdelali sami, da bomo lažje zagotovili uspešno animacijo v brskalniku.</li><ul><h2>Literatura</h2><p>[1] Human spaceflight - artificial atmosphere. <a href='https://en.wikipedia.org/wiki/Human_spaceflight#Artificial_atmosphere'>https://en.wikipedia.org/wiki/Human_spaceflight#Artificial_atmosphere</a>, marec 2016. Dostopano na: 2016-04-10.<br>[2] G. Tavares. Webgl fundamentals. <a href='http://www.html5rocks.com/en/tutorials/webgl/webgl_fundamentals/'>http://www.html5rocks.com/en/tutorials/webgl/webgl_fundamentals/</a>, februar 2012. Dostopano na: 2016-04-07.</p>",
    "images": [
        {
            "id": "1",
            "url": "http://matjazmav.github.io/Kozmos/app_data/articles/TU1-001/slika1.png",
            "description": "Slika 1: Skica nameščenih 'gorivnih celic' na plovilu",
            "authors": ["navedeni zgoraj"]
        },
        {
            "id": "2",
            "url": "http://matjazmav.github.io/Kozmos/app_data/articles/TU1-001/slika2.png",
            "description": "Slika 2: Miselni vzorec z zasnovo projekta evening sky.",
            "authors": ["navedeni zgoraj"]
        }
    ],
    "video": null,
    "other": ""
}