{
  "id": "TU1-002",
  "title": "Best Space-Themed Summer Gifts for Kids",
  "description": "As summer approaches, these fun and educational toys, books and kits can occupy your kids while they're at home. Be warned: they might distract parents, as well!",
  "authors": [
    "SPACE.com Staff"
  ],
  "date": "May 3, 2016 09:00am ET",
  "content": "<p><h2>Space Module Tent</h2>Summer means camping, and camping requires a tent. Why not head into the woods with your own space shuttle, mixing the outdoors with the technical? This themed tent ($35) can provide shelter in the great outdoors or hours of make-believe in the front yard, making it a great summer gift for the kids.<br/><b>Why we love it:</b> For younger kids, the tent can provide hours of fun, while older kids and parents can use it to camp. For more indoor fun, pick up the tunnel attachment that allows your kids to crawl into their spaceport home.<br/><h2>R/C Snap Rover Electronics Discovery Kit</h2>Kids love to take things apart and put them together, but when it comes to electricity the results can sometimes be rather shocking. Enter Snap Circuits, which provides a range of kits with simple instructions on how to build circuits and create everything from a radio to a doorbell to a UFO. For space lovers, the company provides a remote-controlled rover ($58.99 on Amazon) that kids can build themselves, connecting the necessary electronics to get things moving.<br/><b>Why we love it:</b> Many children hate learning — unless they don't realize that's what they're doing. Snap Circuits combines a great education on electricity and circuits with the fun of a remote-controlled vehicle. The rover is just one of many kits available, including Snap Circuits Jr with 100 simple experiments and Snap Circuits 300 with a wider variety of projects.<br/><h2>Thames & Kosmos Remote-Control Machines: Space Explorers Science Kit<h2/>This build-it-yourself robot kit can model 10 different space-based robots, including a Mars rover, robotic arm and satellite ($68.50). All 10 have up to three motors moveable by remote control — and of course, kids are free to get creative and build their own motorized space explorers or gadgets.<br/><b>Why we love it:</b> Kids get the chance to learn about space exploration while building awesome robots and inventions. Plus, driving around something you built is pretty great.</p>",
  "images": [
    {
      "id": "1",
      "url": "http://www.space.com/images/i/000/055/153/original/kids-space-tent.jpg?1461961006?interpolation=lanczos-none&downsize=*:1400",
      "description": "Spend some time indoors or out in a tent that resembles a spaceport.",
      "authors": ["Pacific Play Tents"]
    },
    {
      "id": "2",
      "url": "http://www.space.com/images/i/000/051/182/original/remote-control-machines-space-explorers.jpg?1446141676?interpolation=lanczos-none&downsize=*:1400",
      "description": "Learn about robots in space and build your own remote-control machines with this science kit.",
      "authors": ["Thames & Kosmos"]
    },
    {
      "id": "3",
      "url": "http://www.space.com/images/i/000/055/154/original/rc-snap-rover.jpg?1461962209?interpolation=lanczos-none&downsize=*:1400",
      "description": "Send a rover zooming across your own Martian landscape with a remote controlled rover you wire on your own.",
      "authors": ["Snap Circuits"]
    }
  ],
  "other": "http://www.space.com/27797-kids-gifts.html"
}